Revit 2027 API
View.Discipline Property
 The Discipline of the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewDiscipline Discipline { get; set; }
Public Property Discipline As ViewDiscipline
	Get
	Set
public:
property ViewDiscipline Discipline {
	ViewDiscipline get ();
	void set (ViewDiscipline value);
}
member Discipline : ViewDiscipline with get, set
Property Value
ViewDiscipline
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  View must have a Discipline property -or- When setting this property: View Discipline must be modifiable.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace